{
    "rss": "<?xml version=\"1.0\" encoding=\"UTF-8\"?> <rss version=\"2.0\" xmlns:media=\"http://search.yahoo.com/mrss/\" xmlns:content=\"http://purl.org/rss/1.0/modules/content/\" xmlns:dc=\"http://purl.org/dc/elements/1.1/\" xmlns:atom=\"http://www.w3.org/2005/Atom\" xmlns:sy=\"http://purl.org/rss/1.0/modules/syndication/\">\n        <channel>\n            <title>Lau de Bugs' Blog - fragments</title>\n            <description>Frequent thoughts and ideas</description>\n            <link>https://laudebugs.me/fragments</link>\n            <atom:link href=\"https://www.laudebugs.me/api/rss?section=fragments\" rel=\"self\" type=\"application/rss+xml\"/>\n            <language>en</language>\n            <lastBuildDate>Sat, 23 Jul 2022 15:54:10 GMT</lastBuildDate>\n            <copyright>All rights reserved 2022, Laurence B. Ininda</copyright>\n            <category>relationships</category><category>church</category><category>notes</category><category>hope</category><category>faith</category><category>growth</category><category>greetings</category><category>rituals</category><category>running</category><category>mornings</category><category>winter</category><category>tropics</category><category>memories</category>\n            <image>\n                <url>https://www.laudebugs.me/icons/icon-128x128.png</url>\n                <title>Lau de Bugs' Blog - fragments</title>\n                <link>https://laudebugs.me/fragments</link>\n            </image>\n            \n            \n            <item>\n                <title>Church Notes</title>\n                <link>https://www.laudebugs.me/fragments/church-notes</link>\n                <pubDate>2022-06-26T00:00:00.000Z</pubDate>\n                <author>Laurence B. Ininda</author>\n                <guid>https://www.laudebugs.me/fragments/church-notes</guid>\n                <description>\n                    <![CDATA[ Feeling like going to church again. But understanding how I usually felt and sometimes still feel when I step into it.]]>\n                </description>\n                <content:encoded>\n                    <![CDATA[ <p>I have at times paused for a split second before stepping into church to take a deep breath and moisturized my lips, padded my short afro, straightened the crease on my shirt — put on a mask.\nPerhaps it is something to do with the occasion, the ritual of a Sunday Service that necessitates the performance on my part.\nDress nicely (although I do like dressing nicely in general), smile, say my pleasantries, take notes (that I often don&#39;t go back to) and once it&#39;s all over and I&#39;m out of those door, I can finally stop holding my breathe.</p>\n<p>Why this instinct? Perhaps it is the all the shadows that I haven&#39;t confronted, or maybe it&#39;s the need to please, or rather that church, being among others is in itself a mirror held up to me and my efforts that often fall short.\nFitting into an ideal? What is church anyway other than an idea that I&#39;ve been having splintering opinions about? The one on the podium gesticulates ideas while not trying to be too specific on himself or others.\nGeneral ideas and themes spew and I&#39;m starting to draft opinions on what&#39;s happening in my mind.\nI seem to be able to have my clearest thoughts, unperturbed by the world out there whenever the preacher seems to be saying truths I could&#39;ve read on my own.\nHalf-truths at times because they ignore the cultural contexts surrounding them.\nAnd yet — there&#39;s a pretentious nature to the ceremony.\nSomething off about doing all of this gathering all on a Sunday.\nTo me at least it means I can go back home later, put on some undies, take a nap and get lost in my own medley of todos.\nRinse.\nRepeat.\nAnd again on Sunday get free coffee, try to blend in amidst people whose lives I have no idea what goes on in them.\nLeft gazing into my own self, I fail to see the urgency of the ritual when so much around is broken.\nWhy am I so eager to walk into those church doors when hurting? I tune out at times and project my momentary escapism with myself as unfair suspicion on their part.\nWhat do they <em>not</em> see in me? I see but a mass that cannot be enough, cannot fill this void in the person.</p>\n<p>I crane my neck over the couple seated in front of me and really listen to the exposition being presented — truisms that I find often uncontextualized to what I&#39;m feeling.\nBut what I am feeling really is myself wanting some grandiose rapture and transformation to overcome this stoic smile plastered all over my face and to fall to my knees and seek the Lord who brought me to this place.\nI turn inward and not outward.\nI scribble a thought on the margins of my MoMA notebook — some things I think I would like want to come back to.\nAbortion.\nDeceit.\nPornography.\nRage.\nJealousy.\nAll such things and more that I&#39;ve been complicit to.</p>\n<p>And yes — I avoid confrontation.\nI abhor that feeling of being told I&#39;m in the wrong.\nMy pride self would rather eat itself alive than accept some spiritual milk.\nSo what is it about this man I am that is inclined to think this way? Where is the respite? Can I become myself at the churches I&#39;ve attended over the year.\nWith the slightest evocation of my shortcomings, I slip away to somewhere else and the whole process kickstarts all over again until I stopped going all of a sudden and Sunday was just another day I could make progress on the pint of ice cream in the freezer.\nIf I gain nothing from the experience of church, then I feel at a loss.\nBut hasn&#39;t the institution represented a sense of self-expression that I have given into.\nThe fact that the individual can find full expression in the church.\nFor a while, the church has just been another platform to gain some eyeballs, put myself at the center (again) and smile to someone else even if I have no idea what&#39;s going on behind their (my) own veil.</p>\n<p>But perhaps it doesn&#39;t have to and I can look at the mirror again and be shown where to begin.</p>\n ]]>\n                </content:encoded>\n                <media:content height=\"720\" medium=\"image\" url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/church-notes.jpeg\" width=\"1280\"/>\n                    <media:thumbnail url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/church-notes.jpeg\"/>\n                    <media:credit>\n                                <![CDATA[ Photo by <a href=\"https://unsplash.com/@matthewlejune?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Matthew LeJune</a> on <a href=\"https://unsplash.com/s/photos/shadows?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a> ]]>\n                                </media:credit>\n                    \n\n            </item>\n            \n            <item>\n                <title>A Hopeful Lie</title>\n                <link>https://www.laudebugs.me/fragments/a-hopeful-lie</link>\n                <pubDate>2022-02-27T00:00:00.000Z</pubDate>\n                <author>Laurence B. Ininda</author>\n                <guid>https://www.laudebugs.me/fragments/a-hopeful-lie</guid>\n                <description>\n                    <![CDATA[ How do we have faith when faith needs us to let go of our ego and pride?]]>\n                </description>\n                <content:encoded>\n                    <![CDATA[ <p>I lied to my mother today. An unnecessary lie that came out almost instantaneously, but I could hear the calculus in my brain of the kind of conversation that would transpire without the lie. Or was it the fact that I have been preparing for this lie for a while now or that I have gotten better at lying to myself than to others? Does it matter that I could not be forthcoming to my mother about my faith – and that I did not attend church today; that I have not attended church for a while now; that the business of churchgoing seems so removed from my immediate experience. I have valued the aspect of community, of being there for someone else – but so often it feels so hard to remain in the struggle, to cling to hope, to persist and not give in. How do we have faith when faith needs us to let go of our ego and pride?</p>\n ]]>\n                </content:encoded>\n                <media:content height=\"720\" medium=\"image\" url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/a-hopeful-lie.jpeg\" width=\"1280\"/>\n                    <media:thumbnail url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/a-hopeful-lie.jpeg\"/>\n                    <media:credit>\n                                <![CDATA[ Photo by <a href=\"https://unsplash.com/@evieshaffer?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Evie S.</a> on <a href=\"https://unsplash.com/@laudebugs/likes?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a> ]]>\n                                </media:credit>\n                    \n\n            </item>\n            \n            <item>\n                <title>Folding Skin</title>\n                <link>https://www.laudebugs.me/fragments/folding-skin</link>\n                <pubDate>2021-12-25T00:00:00.000Z</pubDate>\n                <author>Laurence B. Ininda</author>\n                <guid>https://www.laudebugs.me/fragments/folding-skin</guid>\n                <description>\n                    <![CDATA[ Do we learn to love what we disliked with such venom and continue to reinvent ourselves?]]>\n                </description>\n                <content:encoded>\n                    <![CDATA[ <p>Being a little buzzed from a drink, drained from the longest fall season, restless from still giving up on deciding on a movie to watch and still wanting to do something to fill the time, fatigued mentally and from a week of reconnecting with friends I hadn’t seen in a while – I feel like a cauldron mellowing with various emotions, feelings, realities. I wonder – in my alone time, how I can be so whole yet so needing of the networks and relationships that surround me. Perhaps it was living in a noisy house with plenty of siblings, or always having some presence around me throughout boarding school. Yet, I cannot shake the feeling that when lines too straight they go straight to the blinding sun. In other words – we, I meander, my callouses grow, slip on the stairs occasionally, what used to taste horrid now has a comfort to it. We learn to love what we disliked with such venom and continue to reinvent ourselves.</p>\n ]]>\n                </content:encoded>\n                <media:content height=\"720\" medium=\"image\" url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/folding-skin.jpeg\" width=\"1280\"/>\n                    <media:thumbnail url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/folding-skin.jpeg\"/>\n                    <media:credit>\n                                <![CDATA[ Photo by <a href=\"https://unsplash.com/@ilferrets?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Alessio Ferretti</a> on <a href=\"https://unsplash.com/s/photos/evolution?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a> ]]>\n                                </media:credit>\n                    \n\n            </item>\n            \n            <item>\n                <title>In the Middle of the Moving Field</title>\n                <link>https://www.laudebugs.me/fragments/middle-of-the-moving-field</link>\n                <pubDate>2021-12-21T00:00:00.000Z</pubDate>\n                <author>Laurence B. Ininda</author>\n                <guid>https://www.laudebugs.me/fragments/middle-of-the-moving-field</guid>\n                <description>\n                    <![CDATA[ Now, we are moving to the part where the character knows well and true that what he should do and that what he wants to do.]]>\n                </description>\n                <content:encoded>\n                    <![CDATA[ <p>Now, we are moving to the part where the character knows well and true that what he should do and that what he wants to do.</p>\n<p>To attempt to do what one wants to do is more of an act of faith. Doing what one ought to do is the boring choice - the expected route. And do you want to get a pat on the back or do you want to taste some blood. All this will coalesce into your dreams becoming realities that quickly fade and you sink further into the abyss. Or inch slowly towards glory. Your glory — in your terms — your fate — an eternal one. Perhaps you were meant to choose your fate and your fate chose you. </p>\n<p>Anyway, I’m just thinking whether I should just finish this bottle of wine or buy more next time.</p>\n ]]>\n                </content:encoded>\n                <media:content height=\"720\" medium=\"image\" url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/middle-of-the-moving-field.jpeg\" width=\"1280\"/>\n                    <media:thumbnail url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/middle-of-the-moving-field.jpeg\"/>\n                    <media:credit>\n                                <![CDATA[ Photo by <a href=\"https://unsplash.com/@tomonogi?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Karori Production</a> on <a href=\"https://unsplash.com/s/photos/sensation?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a> ]]>\n                                </media:credit>\n                    \n\n            </item>\n            \n            <item>\n                <title>Misery Business</title>\n                <link>https://www.laudebugs.me/fragments/misery-business</link>\n                <pubDate>2021-12-15T00:00:00.000Z</pubDate>\n                <author>Laurence B. Ininda</author>\n                <guid>https://www.laudebugs.me/fragments/misery-business</guid>\n                <description>\n                    <![CDATA[ I felt thirsty, blood circling down to my nearly-sprained ankle. Pacing the trail, dew settled calm on top the stream to my right.]]>\n                </description>\n                <content:encoded>\n                    <![CDATA[ <p>I stepped on a rock mid-stride - my ankle coiled and recoiled. I skimpered a couple of steps, slowed pace and felt the winter wind piercing into my eyes numbing my cheeks and drying my lips. I felt thirsty, blood circling down to my nearly-sprained ankle. Pacing the trail, dew settled calm on top the stream to my right. Ducks, in uniform danced atop the crystal water surface. Dry hybernating trees stared into the air - frozen till Spring. How long to go? I change tracks, watch the couple gallop by. I nurse my foot with small step, then into a half-paced stride - trying to recoup my rhythm for the rest of the way. Still more to go.</p>\n ]]>\n                </content:encoded>\n                <media:content height=\"720\" medium=\"image\" url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/misery-business.jpeg\" width=\"1280\"/>\n                    <media:thumbnail url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/misery-business.jpeg\"/>\n                    <media:credit>\n                                <![CDATA[ Photo by <a href=\"https://unsplash.com/@kaups?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Kaupo Kalda</a> on <a href=\"https://unsplash.com/s/photos/peaceful?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a> ]]>\n                                </media:credit>\n                    \n\n            </item>\n            \n            <item>\n                <title>Orange Clouds</title>\n                <link>https://www.laudebugs.me/fragments/orange-clouds</link>\n                <pubDate>2021-12-07T00:00:00.000Z</pubDate>\n                <author>Laurence B. Ininda</author>\n                <guid>https://www.laudebugs.me/fragments/orange-clouds</guid>\n                <description>\n                    <![CDATA[ There is no replacement for the feeling of the warmth of the cold sand, against the warm ocean water.]]>\n                </description>\n                <content:encoded>\n                    <![CDATA[ <p>There&#39;s no replacement for the feeling of the warmth of the cold sand, against the warm ocean water. When was the last time I went to the beach, and tucked myself in a heap of sand - and forgotten all the todos? It&#39;s been a while since I stared away into the nothingness. This whole year has been about hitting targets, moving forward, playing nice and running so much I sometimes forget I can walk. I find those small moments of rest helpful - the weekends, the evenings and nights ~ but there&#39;s this constant ring in my ear - that keeps me half asleep. I&#39;ve slept little over the past weeks. Perhaps the holidays really are welcome and I need to plan a trip to the beach and maybe to the tropics.</p>\n ]]>\n                </content:encoded>\n                <media:content height=\"720\" medium=\"image\" url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/orange-clouds.jpeg\" width=\"1280\"/>\n                    <media:thumbnail url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/orange-clouds.jpeg\"/>\n                    <media:credit>\n                                <![CDATA[ Photo by <a href=\"https://unsplash.com/@tobiastu?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Tobias Tullius</a> on <a href=\"https://unsplash.com/s/photos/tropic?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a> ]]>\n                                </media:credit>\n                    \n\n            </item>\n            \n            <item>\n                <title>Memories and Fears</title>\n                <link>https://www.laudebugs.me/fragments/memories-and-fears</link>\n                <pubDate>2021-12-05T00:00:00.000Z</pubDate>\n                <author>Laurence B. Ininda</author>\n                <guid>https://www.laudebugs.me/fragments/memories-and-fears</guid>\n                <description>\n                    <![CDATA[ Thinking about how much time I spend awake - trying to keep up, trying to inch ahead.]]>\n                </description>\n                <content:encoded>\n                    <![CDATA[ <p>Thinking about how much time I spend awake - trying to keep up, trying to inch ahead. How I keep on forgetting to do things - or rather, place them at the back of my mind. The important things. Who determines what&#39;s important? I think sometimes there&#39;s a lot to take from the past selves - the memories of fathers and mothers passed down to us - that could apply so particularly to the now - but there&#39;s an arrogance with wanting to walk the road ahead by my own efforts. Such is the wanting to always work, always please, always learn, always serve the self.</p>\n ]]>\n                </content:encoded>\n                <media:content height=\"720\" medium=\"image\" url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/memories-and-fears.jpeg\" width=\"1280\"/>\n                    <media:thumbnail url=\"https://raw.githubusercontent.com/laudebugs/blog-posts/main/assets/memories-and-fears.jpeg\"/>\n                    \n                    \n\n            </item>\n            \n        </channel>\n        </rss>",
    "json": "{}",
    "atom": "feed.atom1()"
}
